Edda-Andrade-IB/TSSE-TP3/build/test/mocks/mock_stm32_hal_cabeceras.h
/* AUTOGENERATED FILE. DO NOT EDIT. */
#ifndef _MOCK_STM32_HAL_CABECERAS_H
#define _MOCK_STM32_HAL_CABECERAS_H

#include "unity.h"
#include "stm32_hal_cabeceras.h"

/* Ignore the following warnings, since we are copying code */
#if defined(__GNUC__) && !defined(__ICC) && !defined(__TMS470__)
#if __GNUC__ > 4 || (__GNUC__ == 4 && (__GNUC_MINOR__ > 6 || (__GNUC_MINOR__ == 6 && __GNUC_PATCHLEVEL__ > 0)))
#pragma GCC diagnostic push
#endif
#if !defined(__clang__)
#pragma GCC diagnostic ignored "-Wpragmas"
#endif
#pragma GCC diagnostic ignored "-Wunknown-pragmas"
#pragma GCC diagnostic ignored "-Wduplicate-decl-specifier"
#endif

void mock_stm32_hal_cabeceras_Init(void);
void mock_stm32_hal_cabeceras_Destroy(void);
void mock_stm32_hal_cabeceras_Verify(void);





#if defined(__GNUC__) && !defined(__ICC) && !defined(__TMS470__)
#if __GNUC__ > 4 || (__GNUC__ == 4 && (__GNUC_MINOR__ > 6 || (__GNUC_MINOR__ == 6 && __GNUC_PATCHLEVEL__ > 0)))
#pragma GCC diagnostic pop
#endif
#endif

#endif
